// Вывести на экран четные числа от 1 до N
int i=1;
int N=50;
while(i<=N)
{
    if (i%2==0) // четные через цикл
        {
        System.Console.Write($"{i} ");
    //i++; // все
    //i=i+2 // четные
        }
}


