// Вывести на экран четные числа от 1 до N
int i=100;
int N=200;
while(i<=N)
{
    System.Console.Write($"{i} ");
    i++;
}
