// Написать программу вычисления значения функции y = sin(a). (Класс Math)
double x,y;
x = Math.PI; // константа чесла числа Пи
y = Math.Sin(x);
System.Console.WriteLine($"sin({x})={y}");
