// Вывести на экран числа от -N до N
int i=1;
int N=50;
while(i<=N)
{
    System.Console.Write($"{i} ");
    //i++; // все
    i=i+2; // четные
}
